ticketing-backend/artillery/script/test1/artillery.yml
config:
  target: 'http://localhost:3002'
  phases:
    - duration: 3
      arrivalRate: 2000
  processor: './reservation-flow.ts'
  payload:
    path: './reservation-test-payload.csv'
    fields:
      - 'userId'
      - 'seatId'
      - 'eventId'
  plugins:
    expect: {}
  environments:
    local:
      target: 'http://localhost:3002'
  defaults:
    headers:
      content-type: 'application/json'
    http:
      timeout: 10
      keepAlive: true
  reports:
    - 'result.json'

scenarios:
  - name: '🎟️ 티켓팅 Full Cycle 테스트'
    flow:
      - function: 'ticketingFullCycle'