ticketing-backend/artillery/script/test1/artillery.yml
config:
  target: 'http://localhost:3002'
  phases:
    - duration: 60 # 2분 동안 부하 발생
      arrivalRate: 10 # 초당 100명 접속
  processor: './reservation-flow.ts'
  payload:
    path: './reservation-test-payload.csv'
    fields:
      - 'userId'
      - 'seatId'
      - 'eventId'
  plugins:
    expect: {}
  environments:
    local:
      target: 'http://localhost:3002'
  defaults:
    headers:
      content-type: 'application/json'
    http:
      timeout: 10
      keepAlive: true
  reports:
    - 'result.json'

scenarios:
  - name: '🎟️ 티켓 예약 전체 시나리오'
    flow:
      - function: 'connectWebSocket'
      - think: 1
      - function: 'waitForActiveStatus'
      - think: 1
      - function: 'simulateReservation'
      - think: 1
      - function: 'simulatePayment'